Revit 2027 API
BuiltInFailures.ElectricalFailures.NotEnoughSlotsOnlyLugAvailableForSwitchPanel Property
 There aren't enough space on switchboard [Panel Name], so the circuit will connect through Feed Through Lugs.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NotEnoughSlotsOnlyLugAvailableForSwitchPanel { get; }
Public Shared ReadOnly Property NotEnoughSlotsOnlyLugAvailableForSwitchPanel As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NotEnoughSlotsOnlyLugAvailableForSwitchPanel {
	FailureDefinitionId^ get ();
}
static member NotEnoughSlotsOnlyLugAvailableForSwitchPanel : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace